In [49]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statistics as st
df=pd.read_csv("C:/Users/admin/Desktop/126156163/archive/raw_sales.csv",parse_dates=['datesold'])
print(df.head(10))
print(df.tail(10))

    datesold  postcode    price propertyType  bedrooms
0 2007-02-07      2607   525000        house         4
1 2007-02-27      2906   290000        house         3
2 2007-03-07      2905   328000        house         3
3 2007-03-09      2905   380000        house         4
4 2007-03-21      2906   310000        house         3
5 2007-04-04      2905   465000        house         4
6 2007-04-24      2607   399000        house         3
7 2007-04-30      2606  1530000        house         4
8 2007-05-24      2902   359000        house         3
9 2007-05-25      2906   320000        house         3
        datesold  postcode   price propertyType  bedrooms
29570 2019-07-25      2620  172500         unit         1
29571 2019-07-25      2603  297500         unit         2
29572 2019-07-25      2606  321000         unit         1
29573 2019-07-25      2603  380000         unit         1
29574 2019-07-25      2612  475000         unit         2
29575 2019-07-25      2900  500000         unit         3
29576 2019-07-25      2612  560000         unit         2
29577 2019-07-26      2912  464950         unit         2
29578 2019-07-26      2601  589000         unit         2
29579 2019-07-26      2612  775000         unit         2

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29580 entries, 0 to 29579
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   datesold      29580 non-null  datetime64[ns]
 1   postcode      29580 non-null  int64
 2   price         29580 non-null  int64
 3   propertyType  29580 non-null  object
 4   bedrooms      29580 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 1.1+ MB

In [7]:
df.describe()

           postcode         price      bedrooms
count  29580.000000  2.958000e+04  29580.000000
mean    2730.249730  6.097363e+05      3.250169
std      146.717292  2.817079e+05      0.951275
min     2600.000000  5.650000e+04      0.000000
25%     2607.000000  4.400000e+05      3.000000
50%     2615.000000  5.500000e+05      3.000000
75%     2905.000000  7.050000e+05      4.000000
max     2914.000000  8.000000e+06      5.000000

In [61]:
df['year']=df['datesold'].dt.year

In [62]:
df.head()

    datesold  postcode   price propertyType  bedrooms  year
0 2007-02-07      2607  525000        house         4  2007
1 2007-02-27      2906  290000        house         3  2007
2 2007-03-07      2905  328000        house         3  2007
3 2007-03-09      2905  380000        house         4  2007
4 2007-03-21      2906  310000        house         3  2007

In [82]:
first=df['year'][0]
last=df['year'][len(df)-1]
print(first,last)

2007 2019

In [86]:
years=list([i for i in range(first,last+1)])
print(years)
print(type(years[0]))

[2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019]
<class 'int'>

In [85]:
averages=[]
for i in range(first,last+1):
    averages.append(st.mean(list(df[df['year']==i]['price'])))
averages

[522377.2108843537,
 493814.1627543036,
 496092.0329593268,
 559564.8102893891,
 566715.1102265768,
 552501.3692142088,
 553416.2968381312,
 592653.76143905,
 626101.3426535088,
 635185.3116683726,
 671880.551420392,
 660701.0427682737,
 634184.2187725632]

In [96]:
for i in years:
    print(i,"---->",len(df[df['year']==i]),"sales")

2007 ----> 147 sales
2008 ----> 639 sales
2009 ----> 1426 sales
2010 ----> 1555 sales
2011 ----> 1633 sales
2012 ----> 1858 sales
2013 ----> 2119 sales
2014 ----> 2863 sales
2015 ----> 3648 sales
2016 ----> 3908 sales
2017 ----> 4541 sales
2018 ----> 3858 sales
2019 ----> 1385 sales

In [97]:
df['month']=df['datesold'].dt.month

In [98]:
df.head()

    datesold  postcode   price propertyType  bedrooms  year  month
0 2007-02-07      2607  525000        house         4  2007      2
1 2007-02-27      2906  290000        house         3  2007      2
2 2007-03-07      2905  328000        house         3  2007      3
3 2007-03-09      2905  380000        house         4  2007      3
4 2007-03-21      2906  310000        house         3  2007      3

In [107]:
a=df.groupby('month')['price'].mean()
print(a)

month
1     556812.934816
2     604714.174322
3     624162.017373
4     615371.905186
5     613112.762603
6     602028.727067
7     588337.742666
8     584237.228489
9     611577.791719
10    611372.174647
11    647936.112186
12    618168.901316
Name: price, dtype: float64